Preethidhanavel/STM32/STM32_REG/EXTI/exti.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

/*
 * led_button.c
 *
 *
 */
#include<stdint.h>
#include"stm32l4xx.h"
#include"stm32l4xx_gpio_driver.h"

void delay()
{
	for(uint32_t i=0;i<250000;i++);
}
int main(void)
{
    /* Loop forever */
	GPIO_Handle_t GpioLed, GpioBtn;
	GpioLed.pGPIOx =GPIOA;
	GpioLed.GPIO_PinConfig.GPIO_PinNumber =GPIO_PIN_NO_5;
	GpioLed.GPIO_PinConfig.GPIO_PinMode=GPIO_MODE_OUT;
	GpioLed.GPIO_PinConfig.GPIO_PinSpeed=GPIO_SPEED_FAST;
	GpioLed.GPIO_PinConfig.GPIO_PinOPType=GPIO_OP_TYPE_PP;  // OUTPUT is configure as push-pull
	//GpioLed.GPIO_PinConfig.GPIO_PinOPType=GPIO_OP_TYPE_OD;    // OUTPUT is configured as open-drain
	GpioLed.GPIO_PinConfig.GPIO_PinPuPdControl=GPIO_NO_PUPD;
	//GpioLed.GPIO_PinConfig.GPIO_PinPuPdControl=GPIO_PIN_PU;
	GPIO_PeriClockControl(GPIOA, ENABLE);
	GPIO_Init(&GpioLed);

	GpioBtn.pGPIOx =GPIOC;
	GpioBtn.GPIO_PinConfig.GPIO_PinNumber =GPIO_PIN_NO_13;
	GpioBtn.GPIO_PinConfig.GPIO_PinMode=GPIO_MODE_IT_FT;
	GpioBtn.GPIO_PinConfig.GPIO_PinSpeed=GPIO_SPEED_FAST;
	GpioBtn.GPIO_PinConfig.GPIO_PinPuPdControl=GPIO_PIN_PU;

	GPIO_PeriClockControl(GPIOC, ENABLE);
	GPIO_Init(&GpioBtn);
	GPIO_PRIORITY_CONFIG(IRQ_NO_EXTI15_10, 15);
	GPIO_IRQInterruptConfig(IRQ_NO_EXTI15_10, ENABLE);
	while(1)
	{
		   GPIO_IRQHandling(GPIO_PIN_NO_13);
			GPIO_ToggleOutputPin(GPIOA, GPIO_PIN_NO_5);

	}

}

